# groupby 第十章

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'], 'key2' : ['one', 'two', 'one', 'two', 'one'],'data1' : np.random.randn(5),
'data2' : np.random.randn(5)})

In [3]:
df

      data1     data2 key1 key2
0 -0.567177  1.603144    a  one
1 -1.052446  1.700441    a  two
2 -0.699983 -0.518185    b  one
3  0.111233 -0.665805    b  two
4 -0.521337 -0.233790    a  one

In [4]:
grouped = df['data1'].groupby(df['key1'])

In [5]:
grouped

In [6]:
grouped.mean()

key1
a   -0.713653
b   -0.294375
Name: data1, dtype: float64

In [7]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()

In [8]:
means

key1  key2
a     one    -0.544257
      two    -1.052446
b     one    -0.699983
      two     0.111233
Name: data1, dtype: float64

In [9]:
means.unstack()

key2       one       two
key1
a    -0.544257 -1.052446
b    -0.699983  0.111233

In [10]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])

In [11]:
states

array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'], dtype='<U10')

In [12]:
years = np.array([2005, 2005, 2006, 2005, 2006])

In [13]:
df['data1'].groupby([states, years]).mean()

California  2005   -1.052446
            2006   -0.699983
Ohio        2005   -0.227972
            2006   -0.521337
Name: data1, dtype: float64

In [14]:
df.groupby('key1').mean()

         data1     data2
key1
a    -0.713653  1.023265
b    -0.294375 -0.591995

In [15]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [16]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
      data1     data2 key1 key2
0 -0.567177  1.603144    a  one
1 -1.052446  1.700441    a  two
4 -0.521337 -0.233790    a  one
b
      data1     data2 key1 key2
2 -0.699983 -0.518185    b  one
3  0.111233 -0.665805    b  two

In [17]:
for (k1, k2), group in df.groupby(['key1', 'key2']):
    print((k1, k2))
    print(group)

('a', 'one')
      data1     data2 key1 key2
0 -0.567177  1.603144    a  one
4 -0.521337 -0.233790    a  one
('a', 'two')
      data1     data2 key1 key2
1 -1.052446  1.700441    a  two
('b', 'one')
      data1     data2 key1 key2
2 -0.699983 -0.518185    b  one
('b', 'two')
      data1     data2 key1 key2
3  0.111233 -0.665805    b  two

In [18]:
pieces = dict(list(df.groupby('key1')))

In [19]:
pieces['b']

      data1     data2 key1 key2
2 -0.699983 -0.518185    b  one
3  0.111233 -0.665805    b  two

In [20]:
df.dtypes

data1    float64
data2    float64
key1      object
key2      object
dtype: object

In [21]:
grouped = df.groupby(df.dtypes, axis=1)

In [23]:
print(grouped)

<pandas.core.groupby.DataFrameGroupBy object at 0x0F5EBD10>

In [24]:
for dtype, group in grouped:
    print(dtype)
    print(group)

float64
      data1     data2
0 -0.567177  1.603144
1 -1.052446  1.700441
2 -0.699983 -0.518185
3  0.111233 -0.665805
4 -0.521337 -0.233790
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

In [25]:
df.groupby(['key1', 'key2'])[['data2']].mean()

              data2
key1 key2
a    one   0.684677
     two   1.700441
b    one  -0.518185
     two  -0.665805

In [26]:
s_grouped = df.groupby(['key1', 'key2'])['data2']

In [27]:
s_grouped

In [28]:
for group in s_grouped:
    print(group)

(('a', 'one'), 0    1.603144
4   -0.233790
Name: data2, dtype: float64)
(('a', 'two'), 1    1.700441
Name: data2, dtype: float64)
(('b', 'one'), 2   -0.518185
Name: data2, dtype: float64)
(('b', 'two'), 3   -0.665805
Name: data2, dtype: float64)

In [29]:
s_grouped.mean()

key1  key2
a     one     0.684677
      two     1.700441
b     one    -0.518185
      two    -0.665805
Name: data2, dtype: float64

In [30]:
people = pd.DataFrame(np.random.randn(5, 5),
    columns=['a', 'b', 'c', 'd', 'e'],
    index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])

In [31]:
people.iloc[2:3, [1, 2]] = np.nan

In [32]:
people

               a         b         c         d         e
Joe     2.815376  0.778609  1.442358  0.600163  0.578352
Steve   0.257877 -0.632153  0.018500 -0.054321  2.029489
Wes     0.045046       NaN       NaN  0.201769  0.040764
Jim    -0.799279  1.084272 -2.011757  0.020899 -0.000936
Travis  0.771154  0.841939  0.240587 -0.219618  0.202829

In [33]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue','d': 'blue', 'e': 'red', 'f' : 'orange'}

In [34]:
by_column = people.groupby(mapping, axis=1)

In [35]:
by_column

In [36]:
by_column.sum()

            blue       red
Joe     2.042521  4.172338
Steve  -0.035822  1.655213
Wes     0.201769  0.085810
Jim    -1.990858  0.284058
Travis  0.020970  1.815921

In [37]:
map_series = pd.Series(mapping)

In [38]:
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [39]:
people.groupby(map_series, axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

In [40]:
people.groupby(len).sum()

          a         b         c         d         e
3  2.061144  1.862882 -0.569399  0.822831  0.618180
5  0.257877 -0.632153  0.018500 -0.054321  2.029489
6  0.771154  0.841939  0.240587 -0.219618  0.202829

In [41]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'],[1, 3, 5, 1, 3]], names=['cty', 'tenor'])

In [42]:
hier_df = pd.DataFrame(np.random.randn(4, 5), columns=columns)

In [43]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0      0.306698 -0.589911  0.399293  0.039228 -0.917854
1     -1.174219  1.121560  0.500370 -1.362251  0.136895
2      0.607880  0.246331 -0.292638 -0.278813 -0.632003
3      1.281126  0.153776 -0.764229  0.195824 -1.209913

In [44]:
hier_df.groupby(level='cty', axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

In [45]:
df

      data1     data2 key1 key2
0 -0.567177  1.603144    a  one
1 -1.052446  1.700441    a  two
2 -0.699983 -0.518185    b  one
3  0.111233 -0.665805    b  two
4 -0.521337 -0.233790    a  one

In [46]:
grouped = df.groupby('key1')

In [47]:
grouped['data1'].quantile(0.9)

key1
a   -0.530505
b    0.030112
Name: data1, dtype: float64

In [48]:
grouped['data1'].quantile(0.5)# 中位数

key1
a   -0.567177
b   -0.294375
Name: data1, dtype: float64

In [49]:
grouped['data1'].median()

key1
a   -0.567177
b   -0.294375
Name: data1, dtype: float64

In [50]:
def peak_to_peak(arr):
    return arr.max() - arr.min()

In [51]:
grouped.agg(peak_to_peak)

         data1     data2
key1
a     0.531109  1.934231
b     0.811217  0.147620

In [52]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0 -0.713653  0.294297 -1.052446 -0.809811 -0.567177 -0.544257
b      2.0 -0.294375  0.573617 -0.699983 -0.497179 -0.294375 -0.091571

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a    -0.521337   3.0  1.023265  1.089728 -0.233790  0.684677  1.603144
b     0.111233   2.0 -0.591995  0.104383 -0.665805 -0.628900 -0.591995


           75%       max
key1
a     1.651793  1.700441
b    -0.555090 -0.518185

In [53]:
tips = pd.read_csv('examples/tips.csv')

In [54]:
tips['tip_pct'] = tips['tip'] / tips['total_bill']

In [56]:
tips.head()

   total_bill   tip smoker  day    time  size   tip_pct
0       16.99  1.01     No  Sun  Dinner     2  0.059447
1       10.34  1.66     No  Sun  Dinner     3  0.160542
2       21.01  3.50     No  Sun  Dinner     3  0.166587
3       23.68  3.31     No  Sun  Dinner     2  0.139780
4       24.59  3.61     No  Sun  Dinner     4  0.146808

In [57]:
grouped = tips.groupby(['day', 'smoker'])

In [58]:
grouped_pct = grouped['tip_pct']

In [59]:
grouped_pct.agg('mean')

day   smoker
Fri   No        0.151650
      Yes       0.174783
Sat   No        0.158048
      Yes       0.147906
Sun   No        0.160113
      Yes       0.187250
Thur  No        0.160298
      Yes       0.163863
Name: tip_pct, dtype: float64

In [60]:
grouped_pct.agg(['mean', 'std', peak_to_peak])

                 mean       std  peak_to_peak
day  smoker
Fri  No      0.151650  0.028123      0.067349
     Yes     0.174783  0.051293      0.159925
Sat  No      0.158048  0.039767      0.235193
     Yes     0.147906  0.061375      0.290095
Sun  No      0.160113  0.042347      0.193226
     Yes     0.187250  0.154134      0.644685
Thur No      0.160298  0.038774      0.193350
     Yes     0.163863  0.039389      0.151240

In [61]:
grouped_pct.agg([('foo', 'mean'), ('bar', np.std)])

                  foo       bar
day  smoker
Fri  No      0.151650  0.028123
     Yes     0.174783  0.051293
Sat  No      0.158048  0.039767
     Yes     0.147906  0.061375
Sun  No      0.160113  0.042347
     Yes     0.187250  0.154134
Thur No      0.160298  0.038774
     Yes     0.163863  0.039389

In [62]:
functions = ['count', 'mean', 'max']

In [63]:
result = grouped['tip_pct', 'total_bill'].agg(functions)

In [64]:
result['tip_pct']

             count      mean       max
day  smoker
Fri  No          4  0.151650  0.187735
     Yes        15  0.174783  0.263480
Sat  No         45  0.158048  0.291990
     Yes        42  0.147906  0.325733
Sun  No         57  0.160113  0.252672
     Yes        19  0.187250  0.710345
Thur No         45  0.160298  0.266312
     Yes        17  0.163863  0.241255

In [65]:
ftuples = [('Durchschnitt', 'mean'), ('Abweichung', np.var)]

In [66]:
grouped['tip_pct', 'total_bill'].agg(ftuples)

                 tip_pct              total_bill
            Durchschnitt Abweichung Durchschnitt  Abweichung
day  smoker
Fri  No         0.151650   0.000791    18.420000   25.596333
     Yes        0.174783   0.002631    16.813333   82.562438
Sat  No         0.158048   0.001581    19.661778   79.908965
     Yes        0.147906   0.003767    21.276667  101.387535
Sun  No         0.160113   0.001793    20.506667   66.099980
     Yes        0.187250   0.023757    24.120000  109.046044
Thur No         0.160298   0.001503    17.113111   59.625081
     Yes        0.163863   0.001551    19.190588   69.808518

In [67]:
grouped['tip_pct', 'total_bill'].agg(ftuples)

                 tip_pct              total_bill
            Durchschnitt Abweichung Durchschnitt  Abweichung
day  smoker
Fri  No         0.151650   0.000791    18.420000   25.596333
     Yes        0.174783   0.002631    16.813333   82.562438
Sat  No         0.158048   0.001581    19.661778   79.908965
     Yes        0.147906   0.003767    21.276667  101.387535
Sun  No         0.160113   0.001793    20.506667   66.099980
     Yes        0.187250   0.023757    24.120000  109.046044
Thur No         0.160298   0.001503    17.113111   59.625081
     Yes        0.163863   0.001551    19.190588   69.808518

In [68]:
grouped.agg({'tip_pct' : ['min', 'max', 'mean', 'std'], 'size' : 'sum'})

              tip_pct                               size
                  min       max      mean       std  sum
day  smoker
Fri  No      0.120385  0.187735  0.151650  0.028123    9
     Yes     0.103555  0.263480  0.174783  0.051293   31
Sat  No      0.056797  0.291990  0.158048  0.039767  115
     Yes     0.035638  0.325733  0.147906  0.061375  104
Sun  No      0.059447  0.252672  0.160113  0.042347  167
     Yes     0.065660  0.710345  0.187250  0.154134   49
Thur No      0.072961  0.266312  0.160298  0.038774  112
     Yes     0.090014  0.241255  0.163863  0.039389   40

In [69]:
tips.groupby(['day', 'smoker'], as_index=False).mean()

    day smoker  total_bill       tip      size   tip_pct
0   Fri     No   18.420000  2.812500  2.250000  0.151650
1   Fri    Yes   16.813333  2.714000  2.066667  0.174783
2   Sat     No   19.661778  3.102889  2.555556  0.158048
3   Sat    Yes   21.276667  2.875476  2.476190  0.147906
4   Sun     No   20.506667  3.167895  2.929825  0.160113
5   Sun    Yes   24.120000  3.516842  2.578947  0.187250
6  Thur     No   17.113111  2.673778  2.488889  0.160298
7  Thur    Yes   19.190588  3.030000  2.352941  0.163863

In [70]:
def top(df, n=5, column='tip_pct'):
    return df.sort_values(by=column)[-n:]

In [71]:
top(tips, n=6)

     total_bill   tip smoker  day    time  size   tip_pct
109       14.31  4.00    Yes  Sat  Dinner     2  0.279525
183       23.17  6.50    Yes  Sun  Dinner     4  0.280535
232       11.61  3.39     No  Sat  Dinner     2  0.291990
67         3.07  1.00    Yes  Sat  Dinner     1  0.325733
178        9.60  4.00    Yes  Sun  Dinner     2  0.416667
172        7.25  5.15    Yes  Sun  Dinner     2  0.710345

In [72]:
tips.groupby('smoker').apply(top)

            total_bill   tip smoker   day    time  size   tip_pct
smoker
No     88        24.71  5.85     No  Thur   Lunch     2  0.236746
       185       20.69  5.00     No   Sun  Dinner     5  0.241663
       51        10.29  2.60     No   Sun  Dinner     2  0.252672
       149        7.51  2.00     No  Thur   Lunch     2  0.266312
       232       11.61  3.39     No   Sat  Dinner     2  0.291990
Yes    109       14.31  4.00    Yes   Sat  Dinner     2  0.279525
       183       23.17  6.50    Yes   Sun  Dinner     4  0.280535
       67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
       178        9.60  4.00    Yes   Sun  Dinner     2  0.416667
       172        7.25  5.15    Yes   Sun  Dinner     2  0.710345

In [73]:
tips.groupby(['smoker', 'day']).apply(top, n=1, column='total_bill')

                 total_bill    tip smoker   day    time  size   tip_pct
smoker day
No     Fri  94        22.75   3.25     No   Fri  Dinner     2  0.142857
       Sat  212       48.33   9.00     No   Sat  Dinner     4  0.186220
       Sun  156       48.17   5.00     No   Sun  Dinner     6  0.103799
       Thur 142       41.19   5.00     No  Thur   Lunch     5  0.121389
Yes    Fri  95        40.17   4.73    Yes   Fri  Dinner     4  0.117750
       Sat  170       50.81  10.00    Yes   Sat  Dinner     3  0.196812
       Sun  182       45.35   3.50    Yes   Sun  Dinner     3  0.077178
       Thur 197       43.11   5.00    Yes  Thur   Lunch     4  0.115982

In [74]:
result = tips.groupby('smoker')['tip_pct'].describe()

In [75]:
result

,count,mean,std,min,25%,50%,75%,max
smoker,,,,,,,,
No,151.0,0.159328,0.039910,0.056797,0.136906,0.155625,0.185014,0.291990
Yes,93.0,0.163196,0.085119,0.035638,0.106771,0.153846,0.195059,0.710345

In [76]:
result.unstack('smoker')

       smoker
count  No        151.000000
       Yes        93.000000
mean   No          0.159328
       Yes         0.163196
std    No          0.039910
       Yes         0.085119
min    No          0.056797
       Yes         0.035638
25%    No          0.136906
       Yes         0.106771
50%    No          0.155625
       Yes         0.153846
75%    No          0.185014
       Yes         0.195059
max    No          0.291990
       Yes         0.710345
dtype: float64

In [77]:
tips.groupby('smoker', group_keys=False).apply(top)

     total_bill   tip smoker   day    time  size   tip_pct
88        24.71  5.85     No  Thur   Lunch     2  0.236746
185       20.69  5.00     No   Sun  Dinner     5  0.241663
51        10.29  2.60     No   Sun  Dinner     2  0.252672
149        7.51  2.00     No  Thur   Lunch     2  0.266312
232       11.61  3.39     No   Sat  Dinner     2  0.291990
109       14.31  4.00    Yes   Sat  Dinner     2  0.279525
183       23.17  6.50    Yes   Sun  Dinner     4  0.280535
67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
178        9.60  4.00    Yes   Sun  Dinner     2  0.416667
172        7.25  5.15    Yes   Sun  Dinner     2  0.710345

In [78]:
frame = pd.DataFrame({'data1': np.random.randn(1000),'data2': np.random.randn(1000)})

In [79]:
quartiles = pd.cut(frame.data1, 4)

In [80]:
quartiles[:10]

0    (-1.476, 0.186]
1     (0.186, 1.848]
2    (-1.476, 0.186]
3    (-1.476, 0.186]
4    (-1.476, 0.186]
5     (0.186, 1.848]
6     (0.186, 1.848]
7     (0.186, 1.848]
8    (-1.476, 0.186]
9     (0.186, 1.848]
Name: data1, dtype: category
Categories (4, interval[float64]): [(-3.144, -1.476] < (-1.476, 0.186] < (0.186, 1.848] < (1.848, 3.51]]

In [81]:
def get_stats(group):
    return {'min': group.min(), 'max': group.max(),
    'count': group.count(), 'mean': group.mean()}

In [82]:
grouped = frame.data2.groupby(quartiles)

In [83]:
grouped.apply(get_stats).unstack()

                  count       max      mean       min
data1
(-3.144, -1.476]   68.0  1.787538  0.006162 -2.198417
(-1.476, 0.186]   531.0  3.241592  0.038628 -2.728495
(0.186, 1.848]    368.0  3.174386 -0.063268 -2.771345
(1.848, 3.51]      33.0  2.391001  0.195986 -2.278599

In [84]:
grouping = pd.qcut(frame.data1, 10, labels=False)

In [85]:
grouped = frame.data2.groupby(grouping)

In [86]:
grouped.apply(get_stats).unstack()

       count       max      mean       min
data1
0      100.0  2.708168  0.068801 -2.198417
1      100.0  2.546274 -0.028616 -2.728495
2      100.0  2.466369  0.003753 -2.182478
3      100.0  1.834299  0.118195 -2.088943
4      100.0  2.002287 -0.029833 -2.063987
5      100.0  3.241592  0.068993 -2.432505
6      100.0  3.174386 -0.103376 -2.771345
7      100.0  2.905241 -0.003447 -2.251029
8      100.0  2.217573 -0.015452 -2.760799
9      100.0  2.391001 -0.037860 -2.278599

In [87]:
s = pd.Series(np.random.randn(6))

In [88]:
s[::2] = np.nan

In [90]:
s

0         NaN
1    2.068578
2         NaN
3   -0.696097
4         NaN
5   -0.555124
dtype: float64

In [91]:
s.fillna(s.mean())

0    0.272453
1    2.068578
2    0.272453
3   -0.696097
4    0.272453
5   -0.555124
dtype: float64

In [92]:
states = ['Ohio', 'New York', 'Vermont', 'Florida', 'Oregon', 'Nevada', 'California', 'Idaho']

In [93]:
group_key = ['East'] * 4 + ['West'] * 4

In [94]:
data = pd.Series(np.random.randn(8), index=states)

In [95]:
data

Ohio         -0.878379
New York      0.847000
Vermont       0.907621
Florida       1.502440
Oregon       -0.608805
Nevada        1.072907
California   -0.215206
Idaho         2.020040
dtype: float64

In [96]:
data[['Vermont', 'Nevada', 'Idaho']] = np.nan
data

Ohio         -0.878379
New York      0.847000
Vermont            NaN
Florida       1.502440
Oregon       -0.608805
Nevada             NaN
California   -0.215206
Idaho              NaN
dtype: float64

In [97]:
data.groupby(group_key).mean()

East    0.490354
West   -0.412005
dtype: float64

In [98]:
fill_mean = lambda g: g.fillna(g.mean())
data.groupby(group_key).apply(fill_mean)

Ohio         -0.878379
New York      0.847000
Vermont       0.490354
Florida       1.502440
Oregon       -0.608805
Nevada       -0.412005
California   -0.215206
Idaho        -0.412005
dtype: float64

In [99]:
fill_values = {'East': 0.5, 'West': -1}

In [100]:
fill_func = lambda g: g.fillna(fill_values[g.name])

In [101]:
data.groupby(group_key).apply(fill_func)

Ohio         -0.878379
New York      0.847000
Vermont       0.500000
Florida       1.502440
Oregon       -0.608805
Nevada       -1.000000
California   -0.215206
Idaho        -1.000000
dtype: float64

In [102]:
suits = ['H', 'S', 'C', 'D']
card_val = (list(range(1, 11)) + [10] * 3) * 4
base_names = ['A'] + list(range(2, 11)) + ['J', 'K', 'Q']
cards = []
for suit in ['H', 'S', 'C', 'D']:
    cards.extend(str(num) + suit for num in base_names)
deck = pd.Series(card_val, index=cards)

In [103]:
deck.head()

AH    1
2H    2
3H    3
4H    4
5H    5
dtype: int64

In [104]:
def draw(deck, n=5):
    return deck.sample(n)

In [105]:
draw(deck)

4S      4
QH     10
3H      3
10H    10
10C    10
dtype: int64

In [106]:
get_suit = lambda card: card[-1]

In [108]:
get_suit

In [109]:
deck.groupby(get_suit).apply(draw, n=2)

C  2C      2
   AC      1
D  10D    10
   QD     10
H  KH     10
   QH     10
S  KS     10
   4S      4
dtype: int64

In [110]:
deck.groupby(get_suit, group_keys=False).apply(draw, n=2)

9C      9
2C      2
9D      9
10D    10
KH     10
7H      7
AS      1
3S      3
dtype: int64

In [111]:
df = pd.DataFrame({'category': ['a', 'a', 'a', 'a', 'b', 'b', 'b', 'b'], 'data': np.random.randn(8),'weights': np.random.rand(8)})

In [112]:
df

  category      data   weights
0        a -0.546711  0.158299
1        a  0.270085  0.590304
2        a -0.739425  0.263223
3        a -0.211373  0.967806
4        b  0.066299  0.419985
5        b -0.875244  0.024144
6        b  0.684878  0.712883
7        b  0.501107  0.629624

In [113]:
grouped = df.groupby('category')

In [114]:
get_wavg = lambda g: np.average(g['data'], weights=g['weights'])

In [115]:
grouped.apply(get_wavg)

category
a   -0.164835
b    0.453623
dtype: float64

In [116]:
close_px = pd.read_csv('examples/stock_px_2.csv', parse_dates=True,index_col=0)

In [117]:
close_px.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 2214 entries, 2003-01-02 to 2011-10-14
Data columns (total 4 columns):
AAPL    2214 non-null float64
MSFT    2214 non-null float64
XOM     2214 non-null float64
SPX     2214 non-null float64
dtypes: float64(4)
memory usage: 86.5 KB

In [118]:
spx_corr = lambda x: x.corrwith(x['SPX'])

In [119]:
rets = close_px.pct_change().dropna()

In [120]:
get_year = lambda x: x.year

In [121]:
by_year = rets.groupby(get_year)

In [122]:
by_year.apply(spx_corr)

          AAPL      MSFT       XOM  SPX
2003  0.541124  0.745174  0.661265  1.0
2004  0.374283  0.588531  0.557742  1.0
2005  0.467540  0.562374  0.631010  1.0
2006  0.428267  0.406126  0.518514  1.0
2007  0.508118  0.658770  0.786264  1.0
2008  0.681434  0.804626  0.828303  1.0
2009  0.707103  0.654902  0.797921  1.0
2010  0.710105  0.730118  0.839057  1.0
2011  0.691931  0.800996  0.859975  1.0

In [123]:
by_year.apply(lambda g: g['AAPL'].corr(g['MSFT']))

2003    0.480868
2004    0.259024
2005    0.300093
2006    0.161735
2007    0.417738
2008    0.611901
2009    0.432738
2010    0.571946
2011    0.581987
dtype: float64

In [124]:
import statsmodels.api as sm
def regress(data, yvar, xvars):
    Y = data[yvar]
    X = data[xvars]
    X['intercept'] = 1.
    result = sm.OLS(Y, X).fit()
    return result.params

ModuleNotFoundError: No module named 'statsmodels'

In [125]:
import statsmodels.api as sm
def regress(data, yvar, xvars):
    Y = data[yvar]
    X = data[xvars]
    X['intercept'] = 1.
    result = sm.OLS(Y, X).fit()
    return result.params

In [126]:
by_year.apply(regress, 'AAPL', ['SPX'])

           SPX  intercept
2003  1.195406   0.000710
2004  1.363463   0.004201
2005  1.766415   0.003246
2006  1.645496   0.000080
2007  1.198761   0.003438
2008  0.968016  -0.001110
2009  0.879103   0.002954
2010  1.052608   0.001261
2011  0.806605   0.001514

In [127]:
tips.pivot_table(index=['day', 'smoker'])

                 size       tip   tip_pct  total_bill
day  smoker
Fri  No      2.250000  2.812500  0.151650   18.420000
     Yes     2.066667  2.714000  0.174783   16.813333
Sat  No      2.555556  3.102889  0.158048   19.661778
     Yes     2.476190  2.875476  0.147906   21.276667
Sun  No      2.929825  3.167895  0.160113   20.506667
     Yes     2.578947  3.516842  0.187250   24.120000
Thur No      2.488889  2.673778  0.160298   17.113111
     Yes     2.352941  3.030000  0.163863   19.190588

In [128]:
tips.pivot_table(['tip_pct', 'size'], index=['time', 'day'], columns='smoker')

                 size             tip_pct
smoker             No       Yes        No       Yes
time   day
Dinner Fri   2.000000  2.222222  0.139622  0.165347
       Sat   2.555556  2.476190  0.158048  0.147906
       Sun   2.929825  2.578947  0.160113  0.187250
       Thur  2.000000       NaN  0.159744       NaN
Lunch  Fri   3.000000  1.833333  0.187735  0.188937
       Thur  2.500000  2.352941  0.160311  0.163863

In [129]:
tips.pivot_table(['tip_pct', 'size'], index=['time', 'day'],columns='smoker', margins=True)

                 size                       tip_pct
smoker             No       Yes       All        No       Yes       All
time   day
Dinner Fri   2.000000  2.222222  2.166667  0.139622  0.165347  0.158916
       Sat   2.555556  2.476190  2.517241  0.158048  0.147906  0.153152
       Sun   2.929825  2.578947  2.842105  0.160113  0.187250  0.166897
       Thur  2.000000       NaN  2.000000  0.159744       NaN  0.159744
Lunch  Fri   3.000000  1.833333  2.000000  0.187735  0.188937  0.188765
       Thur  2.500000  2.352941  2.459016  0.160311  0.163863  0.161301
All          2.668874  2.408602  2.569672  0.159328  0.163196  0.160803

In [130]:
tips.pivot_table('tip_pct', index=['time', 'smoker'], columns='day', aggfunc=len, margins=True)

day             Fri   Sat   Sun  Thur    All
time   smoker
Dinner No       3.0  45.0  57.0   1.0  106.0
       Yes      9.0  42.0  19.0   NaN   70.0
Lunch  No       1.0   NaN   NaN  44.0   45.0
       Yes      6.0   NaN   NaN  17.0   23.0
All            19.0  87.0  76.0  62.0  244.0

In [131]:
tips.pivot_table('tip_pct', index=['time', 'size', 'smoker'], columns='day', aggfunc='mean', fill_value=0)

day                      Fri       Sat       Sun      Thur
time   size smoker
Dinner 1    No      0.000000  0.137931  0.000000  0.000000
            Yes     0.000000  0.325733  0.000000  0.000000
       2    No      0.139622  0.162705  0.168859  0.159744
            Yes     0.171297  0.148668  0.207893  0.000000
       3    No      0.000000  0.154661  0.152663  0.000000
            Yes     0.000000  0.144995  0.152660  0.000000
       4    No      0.000000  0.150096  0.148143  0.000000
            Yes     0.117750  0.124515  0.193370  0.000000
       5    No      0.000000  0.000000  0.206928  0.000000
            Yes     0.000000  0.106572  0.065660  0.000000
       6    No      0.000000  0.000000  0.103799  0.000000
Lunch  1    No      0.000000  0.000000  0.000000  0.181728
            Yes     0.223776  0.000000  0.000000  0.000000
       2    No      0.000000  0.000000  0.000000  0.166005
            Yes     0.181969  0.000000  0.000000  0.158843
       3    No      0.187735  0.000000  0.000000  0.084246
            Yes     0.000000  0.000000  0.000000  0.204952
       4    No      0.000000  0.000000  0.000000  0.138919
            Yes     0.000000  0.000000  0.000000  0.155410
       5    No      0.000000  0.000000  0.000000  0.121389
       6    No      0.000000  0.000000  0.000000  0.173706

In [132]:
data

Ohio         -0.878379
New York      0.847000
Vermont            NaN
Florida       1.502440
Oregon       -0.608805
Nevada             NaN
California   -0.215206
Idaho              NaN
dtype: float64

In [133]:
pd.crosstab(data.Nationality, data.Handedness, margins=True)

AttributeError: 'Series' object has no attribute 'Nationality'

In [134]:
pd.crosstab([tips.time, tips.day], tips.smoker, margins=True)

smoker        No  Yes  All
time   day
Dinner Fri     3    9   12
       Sat    45   42   87
       Sun    57   19   76
       Thur    1    0    1
Lunch  Fri     1    6    7
       Thur   44   17   61
All          151   93  244